#include <allfunc.h>

/*打印邮件内容（0为没有邮件）*/
void mail_print(int x, int y, USER user, int i) 
{
    int rec_num = 0;        //记录数
    char time[40] = {0}, temp[10] = {0};
    char * week[7] = {"SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"};
    RecList RL = {0};
    Record rec = {0};
    AREA AP[14] = {0};
    
    ReadAllRec(user, &RL);
    rec_num = RL.length;
    if(rec_num)     //如果有记录
    {
        rec = RL.elem[i-1];
    }
    DestroyRList(&RL);

    area_read(AP);          //读取地点信息

    sprintf(time, "record\\%s.r", user.name);

    if(rec_num == 0) 
    {
        puthz(x, y, "当前没有邮件", 24, 25, 0);
        return;
    }
    if(user.ifin == 0)
    {
        if(rec.record_time == 1)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第一次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校外人员，我", 
                                    "们决定对您进行警告处理，请您今后校内停车时严格遵",
                                    "守停车规定，不要将机动车于路段禁停时间段停在禁停",
                                    "区域内。如果您再次违停，我们将采取更严厉的惩罚措",
                                    "施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "申诉状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "警告", 32, 33, 63488);
            
        }
        else if(rec.record_time ==  2)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第二次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校外人员，我", 
                                    "们决定禁止您的车辆一天内入校，请您今后校内停车时",
                                    "严格遵守停车规定，不要将机动车于路段禁停时间段停",
                                    "在禁停区域内。如果您再次违停，我们将采取更严厉的",
                                    "惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆一天内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time ==  3)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第三次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校外人员，我", 
                                    "们决定禁止您的车辆三天内入校，请您今后校内停车时",
                                    "严格遵守停车规定，不要将机动车于路段禁停时间段停",
                                    "在禁停区域内。如果您再次违停，我们将采取更严厉的",
                                    "惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆三天内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time ==  4)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第四次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校外人员，我", 
                                    "们决定禁止您的车辆一周内入校，请您今后校内停车时",
                                    "严格遵守停车规定，不要将机动车于路段禁停时间段停",
                                    "在禁停区域内。如果您再次违停，我们将采取更严厉的",
                                    "惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆一周内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time ==  5)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第五次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校外人员，我", 
                                    "们决定禁止您的车辆一个月内入校，请您今后校内停车",
                                    "时严格遵守停车规定，不要将机动车于路段禁停时间段",
                                    "停在禁停区域内。如果您再次违停，我们将采取更严厉",
                                    "的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
        
            puthz(x+33*5, y+34*16, "车辆一个月内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time >= 6)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第六次（及以上）违停，根据《", 
                                    "华中科技大学校园机动车违停管理办法》，由于您是校", 
                                    "外人员，我们决定禁止您的车辆一年内入校，请您今后",
                                    "校内停车时严格遵守停车规定，不要将机动车于路段禁",
                                    "停时间段停在禁停区域内。如果您再次违停，我们将采",
                                    "取更严厉的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆一年内禁止入校", 32, 33, 63488);
        }
    }
    else if(user.ifin == 1)
    {
        if(rec.record_time ==  1)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第一次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校内人员，我", 
                                    "们决定对您进行警告处理，请您今后校内停车时严格遵",
                                    "守停车规定，不要将机动车于路段禁停时间段停在禁停",
                                    "区域内。如果您再次违停，我们将采取更严厉的惩罚措",
                                    "施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "申诉状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "警告", 32, 33, 63488);
            
        }
        else if(rec.record_time ==  2)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第二次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校内人员，我", 
                                    "们决定要求您参加至少两小时志愿活动，请您今后校内",
                                    "停车时严格遵守停车规定，不要将机动车于路段禁停时",
                                    "间段停在禁停区域内。如果您再次违停，我们将采取更",
                                    "严厉的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆一天内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time ==  3)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第三次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校内人员，我", 
                                    "们决定要求您参加至少四小时志愿活动，请您今后校内",
                                    "停车时严格遵守停车规定，不要将机动车于路段禁停时",
                                    "间段停在禁停区域内。如果您再次违停，我们将采取更",
                                    "严厉的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆三天内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time ==  4)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第四次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校内人员，我", 
                                    "们决定要求您参加至少八小时志愿活动，请您今后校内",
                                    "停车时严格遵守停车规定，不要将机动车于路段禁停时",
                                    "间段停在禁停区域内。如果您再次违停，我们将采取更",
                                    "严厉的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆一周内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time ==  5)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第五次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校内人员，我", 
                                    "们决定要求您参加至少十二小时志愿活动，请您今后校",
                                    "内停车时严格遵守停车规定，不要将机动车于路段禁停",
                                    "时间段停在禁停区域内。如果您再次违停，我们将采取",
                                    "更严厉的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
        
            puthz(x+33*5, y+34*16, "车辆一个月内禁止入校", 32, 33, 63488);
        }
        else if(rec.record_time >= 6)
        {
            mail_format_time(rec, time);
            put_asc16_size(x, y, 2, 2, time, 0);
            puthz(x, y+34, "尊敬的用户", 32, 33, 0);
            sprintf(time, "%s:", user.name);
            put_asc16_size(x+34*5, y+34, 2, 2, time, 0);
            puthz_lines(x, y+34*2,  "　　您好！",
                                    "　　您的车辆在本邮件发送五分钟前停放于违停区域，", 
                                    "违停信息已被记录在违停记录系统中，请您及时处理！", 
                                    "　　这是您的机动车的第五次违停，根据《华中科技大", 
                                    "学校园机动车违停管理办法》，由于您是校内人员，我", 
                                    "们决定要求您参加至少十六小时志愿活动，请您今后校",
                                    "内停车时严格遵守停车规定，不要将机动车于路段禁停",
                                    "时间段停在禁停区域内。如果您再次违停，我们将采取",
                                    "更严厉的惩罚措施。谢谢您的配合，祝您生活愉快！",
                                    "　　如对该记录有任何疑问，请到“处理和申诉”板块",
                                    "进行申诉，管理员将会为您处理。",
                                    "",
                                    "违停时间：",
                                    "违停地点：",
                                    "处罚：",
                                    "处理状态：", 
                                    "",
                                    "　　　　　　　　　　　　　　　华中科技大学保卫部");
            puthz(x+33*5, y+34*16, "车辆一年内禁止入校", 32, 33, 63488);
        }
    }

    sprintf(time, "%04d/%02d/%02d %s %02d:%02d:%02d",
        rec.year, rec.month, rec.day, week[rec.week], rec.hour, rec.minute, rec.second);
    put_asc16_size(x+33*5, y+34*14, 2, 2, time, 0);
    puthz(x+33*5, y+34*15, AP[rec.place].name, 32, 33, 0);
    if(rec.appeal_state == 0 
        || rec.appeal_state == 7)
    {
        puthz(x+33*5, y+34*17, "未申诉", 32, 33, 0);
    }
    else if(rec.appeal_state == 1 
        || rec.appeal_state == 5 
        || rec.appeal_state == 6)
    {
        puthz(x+33*5, y+34*17, "已确认", 32, 33, 0);
    }
    else if(rec.appeal_state == 2)
    {
        puthz(x+33*5, y+34*17, "申诉中", 32, 33, 0);
    }
    else if(rec.appeal_state == 3)
    {
        puthz(x+33*5, y+34*17, "申诉成功", 32, 33, 0);
    }
    else if(rec.appeal_state == 4)
    {
        puthz(x+33*5, y+34*17, "申诉失败", 32, 33, 0);
    }
}

/*记录时间处理为邮件格式*/
void mail_format_time(Record rec, char * time)
{
    char temp[10] = {0};
    char * week[7] = {"SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"};
    sprintf(time, "Mail date:");
    sprintf(temp, "%04d", rec.year);
    strcat(time, temp);
    strcat(time, "/");
    sprintf(temp, "%02d", rec.month);
    strcat(time, temp);
    strcat(time, "/");
    sprintf(temp, "%02d", rec.day);
    strcat(time, temp);
    strcat(time, " ");
    sprintf(temp, "%02d", rec.hour);
    strcat(time, temp);
    strcat(time, ":");
    sprintf(temp, "%02d", rec.minute);
    strcat(time, temp);
    strcat(time, ":");
    sprintf(temp, "%02d", rec.second);
    strcat(time, temp);
    strcat(time, " ");
    strcat(time, week[rec.week]);
}

/*检测是否有邮件*/
void mail_new_confirm(USER user, int x, int y)
{
    int i;
    int flag = 0, count = 0;
    char temp[3] = {0};
    RecList RL = {0};
    ReadAllRec(user, &RL);

    for(i = 0; i < RL.length; i++)
    {
        if(RL.elem[i].readif != 1)
        {
            flag = 1;
            count++;
        }
    }
    if(flag && count < 10)
    {
        Circlefill(x, y, 10, 63488);
        sprintf(temp, "%d", count);
        prt_asc16(x-3, y-8, temp, 65535);
    }
    else if(flag && count >= 10)
    {
        Circlefill(x, y, 10, 63488);
        sprintf(temp, "%d", count);
        prt_asc16(x-8, y-8, temp, 65535);
    }
}